In [1]:
import pandas as pd
pd.__version__

'0.25.1'

In [11]:
df = pd.read_excel('./singstats_maritalstatus.xlsx', index_col="Variables")
mydf = df['1980']
mydf

Variables
Total                  1651500
Single                  674100
Married                 864600
Widowed                  97100
Divorced/ Separated      15800
Males                   833500
Single                  375800
Married                 435900
Widowed                  16000
Divorced/ Separated       5700
Females                 818000
Single                  298300
Married                 428700
Widowed                  81100
Divorced/ Separated      10100
Name: 1980, dtype: int64

In [33]:
print(mydf.loc[ mydf[:] > 500000])
rowsMoreThan500k = mydf.loc[ mydf[:] > 500000].count()
print(rowsMoreThan500k)

Variables
Total      1651500
Single      674100
Married     864600
Males       833500
Females     818000
Name: 1980, dtype: int64
5

In [34]:
print(mydf.loc[ mydf[:] < 500000])
rowsLessThan500k = mydf.loc[ mydf[:] < 500000].count()
print(rowsLessThan500k)

Variables
Widowed                 97100
Divorced/ Separated     15800
Single                 375800
Married                435900
Widowed                 16000
Divorced/ Separated      5700
Single                 298300
Married                428700
Widowed                 81100
Divorced/ Separated     10100
Name: 1980, dtype: int64
10

In [52]:
print('*** Data in 1980 column ***')
print(mydf)
print('\n')
print('Number of rows more than 500k is ', rowsMoreThan500k)
print('Number of rows less than 500k is ', rowsLessThan500k)

*** Data in 1980 column ***
Variables
Total                  1651500
Single                  674100
Married                 864600
Widowed                  97100
Divorced/ Separated      15800
Males                   833500
Single                  375800
Married                 435900
Widowed                  16000
Divorced/ Separated       5700
Females                 818000
Single                  298300
Married                 428700
Widowed                  81100
Divorced/ Separated      10100
Name: 1980, dtype: int64


Number of rows more than 500k is  5
Number of rows less than 500k is  10

In [72]:
contains201 = '^201'
df_2010_and_after = df.filter(regex=contains201)
df_2010_and_after

,2010,2011,2012,2013,2014,2015,2016
Variables,,,,,,,
Total,3105700,3148700,3183000,3205900,3259800,3275900,3318500
Single,1000500,1012000,1022600,1029300,1048100,1034500,1049200
Married,1844600,1875900,1899000,1911500,1940100,1945600,1974700
Widowed,157600,157700,152300,158000,161100,172100,174600
Divorced/ Separated,103100,103000,109200,107200,110600,123600,119900
Males,1517400,1534200,1550000,1560900,1583900,1589600,1607500
Single,527100,529600,534700,535100,538500,533200,539700
Married,928400,944300,952200,963100,980800,984700,993900
Widowed,24900,25700,25700,25700,27300,28900,29900
Divorced/ Separated,37100,34600,37500,37000,37300,42700,44100
Females,1588300,1614500,1633000,1645000,1675900,1686300,1711000
Single,473400,482400,487900,494100,509600,501300,509600
Married,916300,931600,946800,948400,959200,960900,980800
Widowed,132700,132000,126700,132300,133700,143200,144700
Divorced/ Separated,66000,68400,71700,70200,73300,80900,75900

In [93]:
newDF = df.head(10)
import numpy as np
print(" **** First 10 rows of original dataset ***")
myDF = newDF.replace('-', np.nan)
myDF

**** First 10 rows of original dataset ***

,1980,1981,1982,1983,1984,1985,1986,1987,1988,1989,...,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016
Variables,,,,,,,,,,,,,,,,,,,,,
Total,1651500,NaN,NaN,1791900,1829000,1866700,1906600,1947600,1990000,2032400,...,2944600,2938800,3034800,3105700,3148700,3183000,3205900,3259800,3275900,3318500
Single,674100,NaN,NaN,728000,714300,726600,736500,735200,745700,752800,...,918400,918700,957600,1000500,1012000,1022600,1029300,1048100,1034500,1049200
Married,864600,NaN,NaN,951200,1005100,1020100,1039700,1083300,1112200,1137800,...,1787100,1783700,1831300,1844600,1875900,1899000,1911500,1940100,1945600,1974700
Widowed,97100,NaN,NaN,101700,92800,99200,108200,106900,108100,116200,...,155600,146900,152700,157600,157700,152300,158000,161100,172100,174600
Divorced/ Separated,15800,NaN,NaN,11000,16700,20800,22300,22200,24100,25700,...,83600,89500,93200,103100,103000,109200,107200,110600,123600,119900
Males,833500,NaN,NaN,901700,912200,929800,948000,974100,994400,1007900,...,1438300,1437200,1477500,1517400,1534200,1550000,1560900,1583900,1589600,1607500
Single,375800,NaN,NaN,404700,393400,400100,408100,410800,416100,418000,...,487500,488900,505100,527100,529600,534700,535100,538500,533200,539700
Married,435900,NaN,NaN,476300,499600,506500,517100,539600,553300,563800,...,894700,896300,913300,928400,944300,952200,963100,980800,984700,993900
Widowed,16000,NaN,NaN,16600,13600,16200,15500,16100,17000,17900,...,26400,22700,26600,24900,25700,25700,25700,27300,28900,29900
Divorced/ Separated,5700,NaN,NaN,4100,5600,7000,7300,7700,8000,8200,...,29700,29300,32400,37100,34600,37500,37000,37300,42700,44100

In [102]:
print("**** Remaining dataset after dropping columns with missing data **** ")
myDF.dropna(1)

**** Remaining dataset after dropping columns with missing data ****

,1980,1983,1984,1985,1986,1987,1988,1989,1990,1991,...,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016
Variables,,,,,,,,,,,,,,,,,,,,,
Total,1651500,1791900,1829000,1866700,1906600,1947600,1990000,2032400,2078800,2153700,...,2944600,2938800,3034800,3105700,3148700,3183000,3205900,3259800,3275900,3318500
Single,674100,728000,714300,726600,736500,735200,745700,752800,747200,760100,...,918400,918700,957600,1000500,1012000,1022600,1029300,1048100,1034500,1049200
Married,864600,951200,1005100,1020100,1039700,1083300,1112200,1137800,1176400,1240000,...,1787100,1783700,1831300,1844600,1875900,1899000,1911500,1940100,1945600,1974700
Widowed,97100,101700,92800,99200,108200,106900,108100,116200,127300,121300,...,155600,146900,152700,157600,157700,152300,158000,161100,172100,174600
Divorced/ Separated,15800,11000,16700,20800,22300,22200,24100,25700,27900,32300,...,83600,89500,93200,103100,103000,109200,107200,110600,123600,119900
Males,833500,901700,912200,929800,948000,974100,994400,1007900,1045600,1077800,...,1438300,1437200,1477500,1517400,1534200,1550000,1560900,1583900,1589600,1607500
Single,375800,404700,393400,400100,408100,410800,416100,418000,422600,424900,...,487500,488900,505100,527100,529600,534700,535100,538500,533200,539700
Married,435900,476300,499600,506500,517100,539600,553300,563800,586700,621600,...,894700,896300,913300,928400,944300,952200,963100,980800,984700,993900
Widowed,16000,16600,13600,16200,15500,16100,17000,17900,26100,20100,...,26400,22700,26600,24900,25700,25700,25700,27300,28900,29900
Divorced/ Separated,5700,4100,5600,7000,7300,7700,8000,8200,10200,11100,...,29700,29300,32400,37100,34600,37500,37000,37300,42700,44100